l = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# Создать новые массивы, содержащие:
# 1. Остаток от деления каждого элемнета на 2
# 2. Мини-массивы из одного элемента в каждом [[1], [2], ...]
# 3. Подмассивы с элемнетами от 0 не доходя до данного [[0], [0, 1], [0, 1, 2], ..]
'''
l_1 = [x % 2 for x in l]
l_2 = [[x] for x in l]
l_3 = [ [x for x in range(0, n)] for n in l]

print(l_1)
print(l_2)
print(l_3)
'''

# Дан массив строк
l = ['abc', 'd', 'efgh', 'bbbbbbb', 'f', 'uio', 'poiqwertypoi']

# Сделать словарь, где:
# 1. ключ - номер строки в массиве, значение - длина строки
# 2. ключ - сама строка, значение - наличие в строке буквы b (True или False)
# 3. ключ - первая буква, значение - эта же строка в виде массива по 1 букве ['a', 'b', 'c', ....]

d_1 = dict()
d_2 = dict()
d_3 = dict()

d_1 = {k: len(l[k]) for k in range(len(l))}
d_2 = {k: 'b' in k for k in l}
d_3 = {k[0]: [n for n in k] for k in l}
print(d_1)
print(d_2)
print(d_3)





