# Включения:

# Дан список списков:

ll = [[1, 2], [3, 4], [5, 6, 7], [8], [9], []]

# Сделать новый список из:
# 1. Сумм исходных подсписков
# 2. Длин исходных подсписков
# 3. Подсписками из нормализованных (делённых на сумму) элементов каждого из подсписков [[0.33, 0.66], [3/7, 4/7], ...]

new_arr = [sum(lst) for lst in ll]
new_arr_2 = [len(lst) for lst in ll]
new_arr_3 = [[el2/sum(el) for el2 in el] for el in ll]

print(new_arr, new_arr_2, new_arr_3, sep='\n')

# Сделать функцию, которая принимает словарь из чисел и строк и возвращает массив длин строк и массив квадратов чисел


